## import

In [1]:
import pandas as pd
import numpy as np

In [2]:
"""
1. 将字典转化为dataframe
"""
data = {"grammer": ["python", "C", "java", "GO", np.nan, "PHP", "SQL"],
        "score": [1, 2, np.nan, 4, 5, 7, 10]}

df = pd.DataFrame(data)
df

  grammer  score
0  python    1.0
1       C    2.0
2    java    NaN
3      GO    4.0
4     NaN    5.0
5     PHP    7.0
6     SQL   10.0

In [3]:
"""
2. 提取含有字符串python的行
"""
df[df['grammer'] == 'python']

  grammer  score
0  python    1.0

In [4]:
"""
3. 输出df所有列列明
"""
df.columns

Index(['grammer', 'score'], dtype='object')

In [5]:
"""
4. 修改第二列列名为polularity
"""
df.rename(columns={'score':'popularity'}, inplace=True)
df

  grammer  popularity
0  python         1.0
1       C         2.0
2    java         NaN
3      GO         4.0
4     NaN         5.0
5     PHP         7.0
6     SQL        10.0

In [6]:
"""
5. 统计grammer列中每种语言出现的次数
"""
df['grammer'].value_counts()

python    1
C         1
java      1
GO        1
PHP       1
SQL       1
Name: grammer, dtype: int64

In [8]:
"""
6. 将空值用上下值的平均值填充
"""
df['popularity'] = df['popularity'].fillna(df['popularity'].interpolate())
df

  grammer  popularity
0  python         1.0
1       C         2.0
2    java         3.0
3      GO         4.0
4     NaN         5.0
5     PHP         7.0
6     SQL        10.0

In [9]:
"""
7. 提取popularity列中值大于3的行
"""
df[df['popularity'] > 3]

  grammer  popularity
3      GO         4.0
4     NaN         5.0
5     PHP         7.0
6     SQL        10.0

In [10]:
"""
8. 按照grammer列去除重复值
"""
df.drop_duplicates(['grammer'])

  grammer  popularity
0  python         1.0
1       C         2.0
2    java         3.0
3      GO         4.0
4     NaN         5.0
5     PHP         7.0
6     SQL        10.0

In [11]:
"""
9. 计算popularity列列平均值
"""
df['popularity'].mean()

4.571428571428571

In [3]:
data = {'name': ['Alice', 'Bod', 'Charlice', 'David', 'Eva'],
        'Age': [24, 27, 22, 32, 29],
        'Score': [85, 90, 78, 88, 92]}
df = pd.DataFrame(data)
df

       name  Age  Score
0     Alice   24     85
1       Bod   27     90
2  Charlice   22     78
3     David   32     88
4       Eva   29     92

In [4]:
filtered_df = df[df['Age'] > 25]
filtered_df

    name  Age  Score
1    Bod   27     90
3  David   32     88
4    Eva   29     92

In [5]:
filtered_df = df[(df['Age'] > 25) & (df['Score'] > 85)]
filtered_df

    name  Age  Score
1    Bod   27     90
3  David   32     88
4    Eva   29     92

In [6]:
filtered_df = df[df['name'].isin(['Alice', 'Bod'])]
filtered_df

    name  Age  Score
0  Alice   24     85
1    Bod   27     90

In [7]:
filtered_df = df[df['name'].str.contains('a', case=False)]
filtered_df

       name  Age  Score
0     Alice   24     85
2  Charlice   22     78
3     David   32     88
4       Eva   29     92

In [8]:
filtered_df = df.query('Age > 25')
filtered_df

    name  Age  Score
1    Bod   27     90
3  David   32     88
4    Eva   29     92

In [9]:
df.loc[5] = ['Frank', None, 80]
filtered_df = df[df['Age'].isna()]
filtered_df

    name   Age  Score
5  Frank  None     80